conf/src/DataProcessors/СборкаТекстовСценариев/СборкаТекстовСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СборкаТекстовСценариев</name>
  <attributes>
    <name>АдресРепозитория</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БезопасноеВыполнениеШагов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьСборкуПроцессов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьСборкуСценариев</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбнаруженияОшибки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДелатьЛогВыполненияСценариевВЖР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелатьОтчетВФорматеCucumber</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелатьОтчетВФорматеjUnit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелатьОтчетВФорматеАллюр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелатьОтчетВФорматеСППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелатьСкриншоты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеПорядкаВоспроизведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеТекстаОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопПараметрыКлиентаТестирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтборПоНастройкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтборПоТестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытьСеанс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдБазыСборки</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗапуска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКаталогаОшибок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаЛогВыполненияСценариев</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаПараметрыJson</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаРезультатовКомпиляции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаЭталонныхБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогOutputAllureБазовый</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогOutputCucumber</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогOutputjUnit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогOutputСкриншоты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогБазыДляЗапуска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогДляЛинейныхСценариев</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогиБиблиотек</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОтчетаСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогПроцессов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСценариев</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСценариевПрочитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловОшибок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФреймворкаТестирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокВыполненияДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПотоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСекундПоискаОкна</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомандаСделатьСкриншот</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпиляцияСценариевСПроверкойАвторизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоUIDНастроекСценариев</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоНастройкамПроцессов</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоНастройкамСценариев</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоПроцессам</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоСценариям</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаузаПриОткрытииОкна</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереданыПараметры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортЗапускаТестКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКИнфобазе</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуДляВыгрузкиСтатусаВыполненияСценариев</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаВРежимеВнешнейОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СделатьСборку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутДляАсинхронныхШагов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗапуска1С</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключенияПоСценариям</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоТегамСценариевИлиНастроек</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключениеПоТегамСценариевИлиНастроек</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодробноеПредставлениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатКомпиляции</name>
    <attributes>
      <name>КодНастройкиСценария</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСценария</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодНастройкиПроцесса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПроцесса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УспешнаяСборка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодробноеПредставлениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>UIDНастройкиСценария</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>UIDСценария</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНастройкиСценария</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

conf/src/Enums/ТипПараметраСценарияИлиПроцесса/ТипПараметраСценарияИлиПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипПараметраСценарияИлиПроцесса</name>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Макет</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ЭталонныеБазыТестирования/ЭталонныеБазыТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭталонныеБазыТестирования</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПроекта</name>
    <type>
      <types>CatalogRef.ВерсииПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>ПрофильПользователя</name>
      <type>
        <types>CatalogRef.ПрофилиПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>Логин</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/DataProcessors/СборкаТекстовСценариев/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции	
	
//Возвращает данные для подключения TestClient
//
// Параметры:
//  ПрофильПользователя - СправочникСсылка.ПрофилиПользователей
//  БазаДанных - СправочникСсылка.ЭталонныеБазы
//
// Возвращаемое значение:
//  - Структура
//  - Неопределено
//
Функция ДанныеДляПодключенияКБДTestClient(Знач ПрофильПользователя,БазаДанных,НастройкаСценария) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БазыДанныхПользователи.Логин КАК Логин,
		|	БазыДанныхПользователи.Пароль КАК Пароль,
		|	БазыДанныхПользователи.ПрофильПользователя.Наименование КАК ИмяПрофиля
		|ИЗ
		|	Справочник.ЭталонныеБазыТестирования.Пользователи КАК БазыДанныхПользователи
		|ГДЕ
		|	БазыДанныхПользователи.Ссылка = &Ссылка
		|	И (БазыДанныхПользователи.ПрофильПользователя = &ПрофильПользователя
		|			ИЛИ БазыДанныхПользователи.ПрофильПользователя.Наименование = &ПрофильПользователя)";
	
	Если ЗначениеЗаполнено(НастройкаСценария) Тогда
		ПрофильПользователя = НастройкаСценария.ПрофильПользователя;
	КонецЕсли;	 
	
	Запрос.УстановитьПараметр("ПрофильПользователя", ПрофильПользователя);
	Запрос.УстановитьПараметр("Ссылка", БазаДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Новый Структура("Логин,Пароль,ИмяПрофиля",ВыборкаДетальныеЗаписи.Логин,ВыборкаДетальныеЗаписи.Пароль,
		                                                                          ВыборкаДетальныеЗаписи.ИмяПрофиля);
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции	

//Возвращает данные для подключения TestClient
//
// Параметры:
//  Сценарий - СправочникСсылка.СценарииРаботыПользователей
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ДанныеВложенныхСценариевИзБД(Сценарий) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СценарииВерсииШаблонов.Шаблон КАК Шаблон
		|ПОМЕСТИТЬ ВложенныеСценарии
		|ИЗ
		|	Справочник.СценарииРаботыПользователей.ВерсииШаблонов КАК СценарииВерсииШаблонов
		|ГДЕ
		|	СценарииВерсииШаблонов.Ссылка = &Ссылка
		|	И НЕ СценарииВерсииШаблонов.Ссылка.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныеСценарии.Шаблон.Ссылка КАК ВложенныйСценарий,
		|	ВложенныеСценарии.Шаблон.ХранилищеСтруктурыСхемы КАК ХранилищеСтруктурыСхемы
		|ИЗ
		|	ВложенныеСценарии КАК ВложенныеСценарии";
	
	Запрос.УстановитьПараметр("Ссылка", Сценарий);
	
	Тзн = Запрос.Выполнить().Выгрузить();
	Тзн.Колонки.Добавить("ДеревоВложенногоСценария");
	
	Для Каждого СтрТзн Из Тзн Цикл
		СтрТзн.ДеревоВложенногоСценария = СтрТзн.ХранилищеСтруктурыСхемы.Получить();
	КонецЦикла;	
	
	Возврат Тзн;
КонецФункции	

//Возвращает данные для подключения TestClient
//
// Параметры:
//  ПараметрыВерсийСценариев - Структура
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ТаблицаШаблоновСценариев(ПараметрыВерсийСценариев) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сценарии.Ссылка КАК Ссылка,
		|	Сценарии.Наименование КАК Наименование,
		|	Сценарии.ВерсияСценария КАК ВерсияСценария,
		|	Сценарии.ФункцияСистемы.Владелец КАК Проект,
		|	Сценарии.СнипетСценария КАК СнипетСценария,
		|	Сценарии.Код КАК Код
		|ПОМЕСТИТЬ Шаблоны
		|ИЗ
		|	Справочник.СценарииРаботыПользователей КАК Сценарии
		|ГДЕ
		|	НЕ Сценарии.ПометкаУдаления
		|	И (Сценарии.РазрешеноИспользоватьВДругихФункциях
		|			ИЛИ Сценарии.ФункцияСистемы = &ФункцияСистемы)
		|	И НЕ Сценарии.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Шаблоны.Ссылка КАК Ссылка,
		|	Шаблоны.ВерсияСценария КАК ВерсияСценария,
		|	Шаблоны.Наименование КАК Наименование,
		|	Шаблоны.СнипетСценария КАК СнипетСценария,
		|	Шаблоны.Код КАК Код
		|ИЗ
		|	Шаблоны КАК Шаблоны
		|ГДЕ
		|	Шаблоны.Проект В(&Проект)";
	
	Запрос.УстановитьПараметр("Проект", ПараметрыВерсийСценариев.Проект);
	Запрос.УстановитьПараметр("ФункцияСистемы", ПараметрыВерсийСценариев.ФункцияСистемы);
	
	Тзн = Запрос.Выполнить().Выгрузить();
	
	Возврат Тзн;
КонецФункции	

//Возвращает нужный тип параметра
//
// Параметры:
//  ТипПараметра - Строка
//
// Возвращаемое значение:
//  Перечисление.ТипПараметраСценария
//
Функция ТипПараметра(ТипПараметра) Экспорт
	Если ТипПараметра = "Строка" Тогда
		Возврат Перечисления.ТипПараметраСценарияИлиПроцесса.Строка;
	ИначеЕсли ТипПараметра = "Число" Тогда
		Возврат Перечисления.ТипПараметраСценарияИлиПроцесса.Число;
	ИначеЕсли ТипПараметра = "Дата" Тогда
		Возврат Перечисления.ТипПараметраСценарияИлиПроцесса.Дата;
	ИначеЕсли ТипПараметра = "Макет" Тогда
		Возврат Перечисления.ТипПараметраСценарияИлиПроцесса.Макет;
	ИначеЕсли ТипПараметра = "Таблица" Тогда
		Возврат Перечисления.ТипПараметраСценарияИлиПроцесса.Таблица;
	Иначе
		Возврат Перечисления.ТипПараметраСценарияИлиПроцесса.Строка;
	КонецЕсли;	 
КонецФункции	

//Возвращает набор свойств объекта.
//
// Параметры:
//  Проект - СправочникСсылка.Проекты
//  ИмяНабора - Строка
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция НаборСвойствОбъекта(Проект, ИмяНабора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.НаборСвойствДляПроцессовВыгружаемый КАК Набор
		|ПОМЕСТИТЬ НаборСвойств
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Ссылка = &Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка КАК Ссылка,
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.НомерСтроки КАК НомерСтроки,
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство,
		|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Наименование КАК Наименование
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
		|ГДЕ
		|	НЕ НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.ПометкаУдаления
		|	И НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка В
		|			(ВЫБРАТЬ
		|				НаборСвойств.Набор
		|			ИЗ
		|				НаборСвойств)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"НаборСвойствДляПроцессовВыгружаемый", ИмяНабора);
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Тзн = Запрос.Выполнить().Выгрузить();
	Тзн.Индексы.Добавить("Свойство");
	Возврат Тзн;
	
КонецФункции	 

// Возвращает значения дополнительных свойств объектов с помощью вызова УправлениеСвойствами.ЗначенияСвойств
//
// Параметры:
//  ОбъектыСоСвойствами  - Массив      - объекты, для которых нужно получить значения дополнительных свойств.
//                       - ЛюбаяСсылка - ссылка на объект, например, СправочникСсылка.Номенклатура,
//                                       ДокументСсылка.ЗаказПокупателя, ...
//  ПолучатьДопРеквизиты - Булево - в результат включать дополнительные реквизиты. По умолчанию Истина.
//  ПолучатьДопСведения  - Булево - в результат включать дополнительные сведения. По умолчанию Истина.
//  Свойства             - Массив - свойства:
//                          * ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения - значения
//                            которых следует получить.
//                          * Строка - уникальное имя дополнительного свойства.
//                       - Неопределено - по умолчанию, получить значения всех свойств владельца.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки:
//    * Свойство - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения - свойство владельца.
//    * Значение - Произвольный - значения любого типа из описания типов свойства объекта метаданных:
//                  "Метаданные.ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Тип".
//    * ВладелецСвойств - ЛюбаяСсылка - ссылка на объект.
//
Функция ЗначенияСвойств(ОбъектыСоСвойствами,
                        ПолучатьДопРеквизиты = Истина,
                        ПолучатьДопСведения = Истина,
                        Свойства = Неопределено) Экспорт
						
	Возврат УправлениеСвойствами.ЗначенияСвойств(ОбъектыСоСвойствами,
                        ПолучатьДопРеквизиты,
                        ПолучатьДопСведения,
                        Свойства); 
КонецФункции

// Возвращает данные сценария пользователя из репозитория
// Параметры:
//  Проект - Справочники.Проекты
//  ДанныеСценария - Структура
//  ТокенПользователя - Строка
//  Ветка - Справочник.Ветки
//  ИдентификаторКоммита - Строка
//
// Возвращаемое значение:
//  Структура
//
Функция ДанныеСценарияИзРепозитория(Проект, ДанныеСценария, ТокенПользователя, Ветка, ИдентификаторКоммита) Экспорт
	Возврат Тестирование.ДанныеСценарияИзРепозитория(
		Проект, ДанныеСценария, ТокенПользователя, Ветка, ИдентификаторКоммита);
КонецФункции	 

#КонецОбласти

#КонецЕсли
